Models/HTR-10_long_coupled/OF/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
47277
(
(-0.0298159 -0.893566 -3.48663)
(-0.0294868 -0.883563 -3.48274)
(-0.0291581 -0.873562 -3.47885)
(-0.137825 -0.883618 -3.49112)
(-0.136268 -0.873742 -3.48724)
(-0.134711 -0.863867 -3.48337)
(-0.222128 -0.866301 -3.48993)
(-0.219641 -0.856626 -3.48606)
...
)
;

boundaryField
{
    Inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
842
(
(-0.030867 -0.84292 -1.2)
(-0.116395 -0.832911 -1.2)
(-0.0609284 -0.813048 -1.2)
(-0.200297 -0.814815 -1.2)
(-0.14488 -0.797822 -1.2)
(-0.282712 -0.789418 -1.2)
(-0.227425 -0.775654 -1.2)
(-0.363544 -0.756307 -1.2)
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
92
(
(0.00660145 0.00515806 -6.1)
(0.0298241 -0.0370426 -6.1)
(0.00661856 -0.0819195 -6.1)
(0.0372502 0.0566317 -6.1)
(-0.0859704 0.0468289 -6.1)
(0.0946331 0.0523589 -6.1)
(-0.0549421 0.00105832 -6.1)
(0.0356522 -0.115207 -6.1)
...
)
;
    }
    Wall
    {
        type            calculated;
        value           nonuniform List<vector> 
5528
(
(-0.0298704 -0.898509 -3.48846)
(-0.138661 -0.888475 -3.49294)
(-0.223341 -0.871075 -3.49175)
(-0.184262 -0.880317 -3.46651)
(-0.308512 -0.844675 -3.49309)
(-0.267452 -0.858584 -3.46666)
(-0.391062 -0.80977 -3.49383)
(-0.35114 -0.827864 -3.46874)
...
)
;
    }
}


// ************************************************************************* //
