Models/HTR-10_long_coupled/OF/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
47277
(
-0.893566
-0.883563
-0.873562
-0.883618
-0.873742
-0.863867
-0.866301
-0.856626
...
)
;

boundaryField
{
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
842
(
-0.84292
-0.832911
-0.813048
-0.814815
-0.797822
-0.789418
-0.775654
-0.756307
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
92
(
0.00515806
-0.0370426
-0.0819195
0.0566317
0.0468289
0.0523589
0.00105832
-0.115207
...
)
;
    }
    Wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
5528
(
-0.898509
-0.888475
-0.871075
-0.880317
-0.844675
-0.858584
-0.80977
-0.827864
...
)
;
    }
}


// ************************************************************************* //
